{"userDefinedMetadata": {"signature": {"outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}, "Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "2"}]}}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}]}}}, "inputs": {"target_seq_len:0": {"name": "target_seq_len:0", "dtype": "DT_INT32", "tensorShape": {}}, "embedding_sample:0": {"name": "embedding_sample:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "8"}]}}}}}, "modelTopology": {"node": [{"op": "Placeholder", "name": "embedding_sample", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "8"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Placeholder", "name": "target_seq_len", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_INT32"}}}, {"op": "NoOp", "name": "Func/StatefulPartitionedCall/input_control_node/_0", "input": ["^embedding_sample", "^target_seq_len"]}, {"op": "Const", "name": "StatefulPartitionedCall/Greater/y", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "StatefulPartitionedCall/ones/Reshape/shape", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"op": "Const", "name": "StatefulPartitionedCall/Reshape_2/shape/3", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"op": "Const", "name": "StatefulPartitionedCall/transpose/perm", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"op": "Const", "name": "StatefulPartitionedCall/meshgrid/Reshape_2/shape", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"op": "Const", "name": "StatefulPartitionedCall/meshgrid/Reshape_3", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"op": "Const", "name": "StatefulPartitionedCall/transpose_2/perm", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"op": "Const", "name": "StatefulPartitionedCall/meshgrid/Reshape/shape", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"op": "Const", "name": "StatefulPartitionedCall/strided_slice_2/stack", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"op": "Const", "name": "StatefulPartitionedCall/strided_slice_2/stack_2", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"op": "Const", "name": "StatefulPartitionedCall/random_uniform/min", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "StatefulPartitionedCall/ones_like/Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "StatefulPartitionedCall/range/start", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"op": "Const", "name": "StatefulPartitionedCall/strided_slice_1/stack_1", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"op": "Const", "name": "StatefulPartitionedCall/Reshape_1/shape", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"op": "Const", "name": "StatefulPartitionedCall/output_model_gmm_dense/Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"op": "Const", "name": "StatefulPartitionedCall/Reshape_7/shape/2", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"op": "Const", "name": "StatefulPartitionedCall/strided_slice_3/stack", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"op": "Const", "name": "StatefulPartitionedCall/strided_slice_3/stack_1", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"op": "Const", "name": "StatefulPartitionedCall/strided_slice_3/stack_2", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"op": "Shape", "name": "StatefulPartitionedCall/Shape", "input": ["embedding_sample", "^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "StatefulPartitionedCall/strided_slice_4/stack", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"op": "Const", "name": "StatefulPartitionedCall/strided_slice_1/stack", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"op": "Const", "name": "StatefulPartitionedCall/Reshape_7/shape/1", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"op": "Const", "name": "StatefulPartitionedCall/Reshape_2/shape/2", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"op": "Const", "name": "StatefulPartitionedCall/decoder/dense_36/BiasAdd/ReadVariableOp", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "StatefulPartitionedCall/decoder/dense_36/MatMul/ReadVariableOp", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "StatefulPartitionedCall/decoder/dense_37/BiasAdd/ReadVariableOp", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "StatefulPartitionedCall/decoder/dense_37/MatMul/ReadVariableOp", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "StatefulPartitionedCall/decoder/dense_38/BiasAdd/ReadVariableOp", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "StatefulPartitionedCall/decoder/dense_38/MatMul/ReadVariableOp", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "StatefulPartitionedCall/decoder/dense_39/BiasAdd/ReadVariableOp", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "StatefulPartitionedCall/decoder/dense_39/MatMul/ReadVariableOp", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "StatefulPartitionedCall/output_model_gmm_dense/gmm_all/BiasAdd/ReadVariableOp", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "StatefulPartitionedCall/output_model_gmm_dense/gmm_all/MatMul/ReadVariableOp", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "StridedSlice", "name": "StatefulPartitionedCall/strided_slice_2", "input": ["embedding_sample", "StatefulPartitionedCall/strided_slice_2/stack", "StatefulPartitionedCall/strided_slice_2/stack", "StatefulPartitionedCall/strided_slice_2/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "end_mask": {"i": "5"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "2"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "Index": {"type": "DT_INT32"}}}, {"op": "LinSpace", "name": "StatefulPartitionedCall/LinSpace", "input": ["StatefulPartitionedCall/random_uniform/min", "StatefulPartitionedCall/ones_like/Const", "target_seq_len"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"op": "StridedSlice", "name": "StatefulPartitionedCall/strided_slice", "input": ["StatefulPartitionedCall/Shape", "StatefulPartitionedCall/strided_slice_4/stack", "StatefulPartitionedCall/strided_slice_1/stack", "StatefulPartitionedCall/strided_slice_1/stack"], "attr": {"T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"op": "NoOp", "name": "Func/StatefulPartitionedCall/output_control_node/_16", "input": ["^StatefulPartitionedCall/decoder/dense_36/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/decoder/dense_36/MatMul/ReadVariableOp", "^StatefulPartitionedCall/decoder/dense_37/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/decoder/dense_37/MatMul/ReadVariableOp", "^StatefulPartitionedCall/decoder/dense_38/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/decoder/dense_38/MatMul/ReadVariableOp", "^StatefulPartitionedCall/decoder/dense_39/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/decoder/dense_39/MatMul/ReadVariableOp", "^StatefulPartitionedCall/output_model_gmm_dense/gmm_all/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/output_model_gmm_dense/gmm_all/MatMul/ReadVariableOp"]}, {"op": "ExpandDims", "name": "StatefulPartitionedCall/ExpandDims", "input": ["StatefulPartitionedCall/LinSpace", "StatefulPartitionedCall/range/start"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"op": "Reshape", "name": "StatefulPartitionedCall/ones/Reshape", "input": ["StatefulPartitionedCall/strided_slice", "StatefulPartitionedCall/ones/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"op": "Pack", "name": "StatefulPartitionedCall/Tile/multiples", "input": ["StatefulPartitionedCall/strided_slice", "StatefulPartitionedCall/Reshape_7/shape/2"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"op": "Pack", "name": "StatefulPartitionedCall/Reshape_7/shape", "input": ["StatefulPartitionedCall/strided_slice", "StatefulPartitionedCall/Reshape_7/shape/1", "StatefulPartitionedCall/Reshape_7/shape/2"], "attr": {"axis": {"i": "0"}, "N": {"i": "3"}, "T": {"type": "DT_INT32"}}}, {"op": "Pack", "name": "StatefulPartitionedCall/Reshape_6/shape", "input": ["StatefulPartitionedCall/strided_slice", "StatefulPartitionedCall/Reshape_7/shape/1", "StatefulPartitionedCall/Reshape_2/shape/2"], "attr": {"axis": {"i": "0"}, "N": {"i": "3"}, "T": {"type": "DT_INT32"}}}, {"op": "Fill", "name": "StatefulPartitionedCall/ones", "input": ["StatefulPartitionedCall/ones/Reshape", "StatefulPartitionedCall/Reshape_7/shape/2"], "attr": {"T": {"type": "DT_INT32"}, "index_type": {"type": "DT_INT32"}}}, {"op": "Tile", "name": "StatefulPartitionedCall/Tile", "input": ["StatefulPartitionedCall/ExpandDims", "StatefulPartitionedCall/Tile/multiples"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT32"}}}, {"op": "Mul", "name": "StatefulPartitionedCall/mul", "input": ["StatefulPartitionedCall/ones", "target_seq_len"], "attr": {"T": {"type": "DT_INT32"}}}, {"op": "Reshape", "name": "StatefulPartitionedCall/Reshape", "input": ["StatefulPartitionedCall/Tile", "StatefulPartitionedCall/meshgrid/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"op": "Shape", "name": "StatefulPartitionedCall/Shape_1", "input": ["StatefulPartitionedCall/Tile"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"op": "Identity", "name": "Identity_1", "input": ["StatefulPartitionedCall/mul", "^Func/StatefulPartitionedCall/output_control_node/_16"], "attr": {"T": {"type": "DT_INT32"}}}, {"op": "StridedSlice", "name": "StatefulPartitionedCall/strided_slice_1", "input": ["StatefulPartitionedCall/Shape_1", "StatefulPartitionedCall/strided_slice_1/stack", "StatefulPartitionedCall/strided_slice_1/stack_1", "StatefulPartitionedCall/strided_slice_1/stack"], "attr": {"T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"op": "Pack", "name": "StatefulPartitionedCall/Tile_1/multiples", "input": ["StatefulPartitionedCall/Reshape_7/shape/2", "StatefulPartitionedCall/strided_slice_1", "StatefulPartitionedCall/Reshape_7/shape/2"], "attr": {"axis": {"i": "0"}, "N": {"i": "3"}, "T": {"type": "DT_INT32"}}}, {"op": "Tile", "name": "StatefulPartitionedCall/Tile_1", "input": ["StatefulPartitionedCall/strided_slice_2", "StatefulPartitionedCall/Tile_1/multiples"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT32"}}}, {"op": "Reshape", "name": "StatefulPartitionedCall/Reshape_1", "input": ["StatefulPartitionedCall/Tile_1", "StatefulPartitionedCall/Reshape_1/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"op": "ConcatV2", "name": "StatefulPartitionedCall/concat", "input": ["StatefulPartitionedCall/Reshape", "StatefulPartitionedCall/Reshape_1", "StatefulPartitionedCall/Reshape_7/shape/1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"op": "_FusedMatMul", "name": "StatefulPartitionedCall/decoder/dense_36/Relu", "input": ["StatefulPartitionedCall/concat", "StatefulPartitionedCall/decoder/dense_36/MatMul/ReadVariableOp", "StatefulPartitionedCall/decoder/dense_36/BiasAdd/ReadVariableOp"], "attr": {"transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}, "device": "/device:CPU:0"}, {"op": "_FusedMatMul", "name": "StatefulPartitionedCall/decoder/dense_37/Relu", "input": ["StatefulPartitionedCall/decoder/dense_36/Relu", "StatefulPartitionedCall/decoder/dense_37/MatMul/ReadVariableOp", "StatefulPartitionedCall/decoder/dense_37/BiasAdd/ReadVariableOp"], "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}, "device": "/device:CPU:0"}, {"op": "_FusedMatMul", "name": "StatefulPartitionedCall/decoder/dense_38/Relu", "input": ["StatefulPartitionedCall/decoder/dense_37/Relu", "StatefulPartitionedCall/decoder/dense_38/MatMul/ReadVariableOp", "StatefulPartitionedCall/decoder/dense_38/BiasAdd/ReadVariableOp"], "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}, "device": "/device:CPU:0"}, {"op": "_FusedMatMul", "name": "StatefulPartitionedCall/decoder/dense_39/Relu", "input": ["StatefulPartitionedCall/decoder/dense_38/Relu", "StatefulPartitionedCall/decoder/dense_39/MatMul/ReadVariableOp", "StatefulPartitionedCall/decoder/dense_39/BiasAdd/ReadVariableOp"], "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}, "device": "/device:CPU:0"}, {"op": "_FusedMatMul", "name": "StatefulPartitionedCall/output_model_gmm_dense/gmm_all/BiasAdd", "input": ["StatefulPartitionedCall/decoder/dense_39/Relu", "StatefulPartitionedCall/output_model_gmm_dense/gmm_all/MatMul/ReadVariableOp", "StatefulPartitionedCall/output_model_gmm_dense/gmm_all/BiasAdd/ReadVariableOp"], "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}, "device": "/device:CPU:0"}, {"op": "SplitV", "name": "StatefulPartitionedCall/output_model_gmm_dense/split", "input": ["StatefulPartitionedCall/output_model_gmm_dense/gmm_all/BiasAdd", "StatefulPartitionedCall/output_model_gmm_dense/Const", "StatefulPartitionedCall/Reshape_7/shape/1"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "3"}, "Tlen": {"type": "DT_INT32"}}}, {"op": "StridedSlice", "name": "StatefulPartitionedCall/strided_slice_3", "input": ["StatefulPartitionedCall/output_model_gmm_dense/split", "StatefulPartitionedCall/strided_slice_3/stack", "StatefulPartitionedCall/strided_slice_3/stack_1", "StatefulPartitionedCall/strided_slice_3/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "end_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}}}, {"op": "Shape", "name": "StatefulPartitionedCall/Shape_3", "input": ["StatefulPartitionedCall/output_model_gmm_dense/split"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"op": "LogSoftmax", "name": "StatefulPartitionedCall/Log", "input": ["StatefulPartitionedCall/output_model_gmm_dense/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"op": "Shape", "name": "StatefulPartitionedCall/ones_like/Shape", "input": ["StatefulPartitionedCall/strided_slice_3"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"op": "StridedSlice", "name": "StatefulPartitionedCall/strided_slice_4", "input": ["StatefulPartitionedCall/Shape_3", "StatefulPartitionedCall/strided_slice_4/stack", "StatefulPartitionedCall/strided_slice_1/stack", "StatefulPartitionedCall/strided_slice_1/stack"], "attr": {"T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"op": "AddV2", "name": "StatefulPartitionedCall/add", "input": ["StatefulPartitionedCall/Log", "StatefulPartitionedCall/ones_like/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"op": "Fill", "name": "StatefulPartitionedCall/ones_like", "input": ["StatefulPartitionedCall/ones_like/Shape", "StatefulPartitionedCall/ones_like/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"op": "Pack", "name": "StatefulPartitionedCall/Reshape_2/shape", "input": ["StatefulPartitionedCall/strided_slice_4", "StatefulPartitionedCall/Reshape_7/shape/2", "StatefulPartitionedCall/Reshape_2/shape/2", "StatefulPartitionedCall/Reshape_2/shape/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"op": "Range", "name": "StatefulPartitionedCall/range", "input": ["StatefulPartitionedCall/range/start", "StatefulPartitionedCall/strided_slice_4", "StatefulPartitionedCall/Reshape_7/shape/2"], "attr": {"Tidx": {"type": "DT_INT32"}}}, {"op": "Pack", "name": "StatefulPartitionedCall/Reshape_5/shape", "input": ["StatefulPartitionedCall/strided_slice_4", "StatefulPartitionedCall/Reshape_7/shape/2"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"op": "ArgMax", "name": "StatefulPartitionedCall/ArgMax", "input": ["StatefulPartitionedCall/add", "StatefulPartitionedCall/Reshape_7/shape/2"], "attr": {"output_type": {"type": "DT_INT64"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"op": "Shape", "name": "StatefulPartitionedCall/Shape_2", "input": ["StatefulPartitionedCall/ones_like"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"op": "Reshape", "name": "StatefulPartitionedCall/Reshape_2", "input": ["StatefulPartitionedCall/output_model_gmm_dense/split", "StatefulPartitionedCall/Reshape_2/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"op": "Reshape", "name": "StatefulPartitionedCall/meshgrid/Reshape_2", "input": ["StatefulPartitionedCall/range", "StatefulPartitionedCall/meshgrid/Reshape_2/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"op": "Size", "name": "StatefulPartitionedCall/meshgrid/Size", "input": ["StatefulPartitionedCall/range"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"op": "Reshape", "name": "StatefulPartitionedCall/Reshape_5", "input": ["StatefulPartitionedCall/ArgMax", "StatefulPartitionedCall/Reshape_5/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"op": "RandomUniform", "name": "StatefulPartitionedCall/random_uniform/RandomUniform", "input": ["StatefulPartitionedCall/Shape_2"], "attr": {"seed": {"i": "0"}, "dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"op": "Transpose", "name": "StatefulPartitionedCall/transpose", "input": ["StatefulPartitionedCall/Reshape_2", "StatefulPartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"op": "Pack", "name": "StatefulPartitionedCall/meshgrid/ones/packed", "input": ["StatefulPartitionedCall/Reshape_7/shape/2", "StatefulPartitionedCall/meshgrid/Size"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"op": "Cast", "name": "StatefulPartitionedCall/Cast_1", "input": ["StatefulPartitionedCall/Reshape_5"], "attr": {"SrcT": {"type": "DT_INT64"}, "Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}}}, {"op": "Greater", "name": "StatefulPartitionedCall/Greater", "input": ["StatefulPartitionedCall/random_uniform/RandomUniform", "StatefulPartitionedCall/Greater/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"op": "Fill", "name": "StatefulPartitionedCall/meshgrid/ones", "input": ["StatefulPartitionedCall/meshgrid/ones/packed", "StatefulPartitionedCall/Reshape_7/shape/2"], "attr": {"T": {"type": "DT_INT32"}, "index_type": {"type": "DT_INT32"}}}, {"op": "Cast", "name": "StatefulPartitionedCall/Cast", "input": ["StatefulPartitionedCall/Greater"], "attr": {"SrcT": {"type": "DT_BOOL"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"op": "Mul", "name": "StatefulPartitionedCall/meshgrid/mul", "input": ["StatefulPartitionedCall/meshgrid/Reshape_2", "StatefulPartitionedCall/meshgrid/ones"], "attr": {"T": {"type": "DT_INT32"}}}, {"op": "Mul", "name": "StatefulPartitionedCall/meshgrid/mul_1", "input": ["StatefulPartitionedCall/meshgrid/Reshape_3", "StatefulPartitionedCall/meshgrid/ones"], "attr": {"T": {"type": "DT_INT32"}}}, {"op": "Reshape", "name": "StatefulPartitionedCall/Reshape_7", "input": ["StatefulPartitionedCall/Cast", "StatefulPartitionedCall/Reshape_7/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"op": "Transpose", "name": "StatefulPartitionedCall/transpose_2", "input": ["StatefulPartitionedCall/meshgrid/mul", "StatefulPartitionedCall/transpose_2/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"op": "Transpose", "name": "StatefulPartitionedCall/transpose_3", "input": ["StatefulPartitionedCall/meshgrid/mul_1", "StatefulPartitionedCall/transpose_2/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"op": "Identity", "name": "Identity", "input": ["StatefulPartitionedCall/Reshape_7", "^Func/StatefulPartitionedCall/output_control_node/_16"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"op": "Pack", "name": "StatefulPartitionedCall/stack", "input": ["StatefulPartitionedCall/transpose_2", "StatefulPartitionedCall/transpose_3", "StatefulPartitionedCall/Cast_1"], "attr": {"axis": {"i": "-1"}, "N": {"i": "3"}, "T": {"type": "DT_INT32"}}}, {"op": "GatherNd", "name": "StatefulPartitionedCall/GatherNd", "input": ["StatefulPartitionedCall/transpose", "StatefulPartitionedCall/stack"], "attr": {"Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}}}, {"op": "StridedSlice", "name": "StatefulPartitionedCall/strided_slice_5", "input": ["StatefulPartitionedCall/GatherNd", "StatefulPartitionedCall/strided_slice_3/stack", "StatefulPartitionedCall/strided_slice_3/stack_1", "StatefulPartitionedCall/strided_slice_3/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "end_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}}}, {"op": "Reshape", "name": "StatefulPartitionedCall/Reshape_6", "input": ["StatefulPartitionedCall/strided_slice_5", "StatefulPartitionedCall/Reshape_6/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"op": "Identity", "name": "Identity_2", "input": ["StatefulPartitionedCall/Reshape_6", "^Func/StatefulPartitionedCall/output_control_node/_16"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {"producer": 175}}, "format": "graph-model", "weightsManifest": [{"weights": [{"name": "StatefulPartitionedCall/Greater/y", "dtype": "float32", "shape": []}, {"name": "StatefulPartitionedCall/ones/Reshape/shape", "dtype": "int32", "shape": [1]}, {"name": "StatefulPartitionedCall/Reshape_2/shape/3", "dtype": "int32", "shape": []}, {"name": "StatefulPartitionedCall/transpose/perm", "dtype": "int32", "shape": [4]}, {"name": "StatefulPartitionedCall/meshgrid/Reshape_2/shape", "dtype": "int32", "shape": [2]}, {"name": "StatefulPartitionedCall/meshgrid/Reshape_3", "dtype": "int32", "shape": [1, 1]}, {"name": "StatefulPartitionedCall/transpose_2/perm", "dtype": "int32", "shape": [2]}, {"name": "StatefulPartitionedCall/meshgrid/Reshape/shape", "dtype": "int32", "shape": [2]}, {"name": "StatefulPartitionedCall/strided_slice_2/stack", "dtype": "int32", "shape": [3]}, {"name": "StatefulPartitionedCall/strided_slice_2/stack_2", "dtype": "int32", "shape": [3]}, {"name": "StatefulPartitionedCall/random_uniform/min", "dtype": "float32", "shape": []}, {"name": "StatefulPartitionedCall/ones_like/Const", "dtype": "float32", "shape": []}, {"name": "StatefulPartitionedCall/range/start", "dtype": "int32", "shape": []}, {"name": "StatefulPartitionedCall/strided_slice_1/stack_1", "dtype": "int32", "shape": [1]}, {"name": "StatefulPartitionedCall/Reshape_1/shape", "dtype": "int32", "shape": [2]}, {"name": "StatefulPartitionedCall/output_model_gmm_dense/Const", "dtype": "int32", "shape": [3]}, {"name": "StatefulPartitionedCall/Reshape_7/shape/2", "dtype": "int32", "shape": []}, {"name": "StatefulPartitionedCall/strided_slice_3/stack", "dtype": "int32", "shape": [2]}, {"name": "StatefulPartitionedCall/strided_slice_3/stack_1", "dtype": "int32", "shape": [2]}, {"name": "StatefulPartitionedCall/strided_slice_3/stack_2", "dtype": "int32", "shape": [2]}, {"name": "StatefulPartitionedCall/strided_slice_4/stack", "dtype": "int32", "shape": [1]}, {"name": "StatefulPartitionedCall/strided_slice_1/stack", "dtype": "int32", "shape": [1]}, {"name": "StatefulPartitionedCall/Reshape_7/shape/1", "dtype": "int32", "shape": []}, {"name": "StatefulPartitionedCall/Reshape_2/shape/2", "dtype": "int32", "shape": []}, {"name": "StatefulPartitionedCall/decoder/dense_36/BiasAdd/ReadVariableOp", "dtype": "float32", "shape": [512]}, {"name": "StatefulPartitionedCall/decoder/dense_36/MatMul/ReadVariableOp", "dtype": "float32", "shape": [9, 512]}, {"name": "StatefulPartitionedCall/decoder/dense_37/BiasAdd/ReadVariableOp", "dtype": "float32", "shape": [512]}, {"name": "StatefulPartitionedCall/decoder/dense_37/MatMul/ReadVariableOp", "dtype": "float32", "shape": [512, 512]}, {"name": "StatefulPartitionedCall/decoder/dense_38/BiasAdd/ReadVariableOp", "dtype": "float32", "shape": [512]}, {"name": "StatefulPartitionedCall/decoder/dense_38/MatMul/ReadVariableOp", "dtype": "float32", "shape": [512, 512]}, {"name": "StatefulPartitionedCall/decoder/dense_39/BiasAdd/ReadVariableOp", "dtype": "float32", "shape": [512]}, {"name": "StatefulPartitionedCall/decoder/dense_39/MatMul/ReadVariableOp", "dtype": "float32", "shape": [512, 512]}, {"name": "StatefulPartitionedCall/output_model_gmm_dense/gmm_all/BiasAdd/ReadVariableOp", "dtype": "float32", "shape": [100]}, {"name": "StatefulPartitionedCall/output_model_gmm_dense/gmm_all/MatMul/ReadVariableOp", "dtype": "float32", "shape": [512, 100]}], "paths": ["group1-shard1of1.bin"]}], "generatedBy": "2.1.0", "convertedBy": "TensorFlow.js Converter v1.7.3"}