{"userDefinedMetadata": {"signature": {"inputs": {"target_pos:0": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "2"}]}, "name": "target_pos:0"}, "inp_pos:0": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "2"}]}, "name": "inp_pos:0"}, "inp_embeddings:0": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "8"}]}, "name": "inp_embeddings:0"}}, "outputs": {"Identity_2:0": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}, "name": "Identity_2:0"}, "Identity_1:0": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "10"}, {"size": "8"}]}, "name": "Identity_1:0"}, "Identity:0": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "8"}]}, "name": "Identity:0"}, "Identity_3:0": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "10"}, {"size": "8"}]}, "name": "Identity_3:0"}}}}, "modelTopology": {"node": [{"attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "8"}]}}, "dtype": {"type": "DT_FLOAT"}}, "name": "inp_embeddings", "op": "Placeholder"}, {"attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "2"}]}}, "dtype": {"type": "DT_FLOAT"}}, "name": "inp_pos", "op": "Placeholder"}, {"attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "2"}]}}, "dtype": {"type": "DT_FLOAT"}}, "name": "target_pos", "op": "Placeholder"}, {"input": ["^inp_embeddings", "^inp_pos", "^target_pos"], "name": "Func/StatefulPartitionedCall/input_control_node/_0", "op": "NoOp"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/meshgrid/Reshape_2/shape", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/meshgrid/Reshape_3", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transpose_2/perm", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/layer_normalization_12/batchnorm/add/y", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_5/multi_head_attention_17/strided_slice_1/stack", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/add/y", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/strided_slice_1/stack", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/strided_slice_1/stack_2", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_5/multi_head_attention_17/mul/y", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_5/multi_head_attention_17/Reshape/shape/2", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_5/multi_head_attention_17/Reshape/shape/3", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_5/multi_head_attention_17/transpose/perm", "op": "Const"}, {"attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "input": ["inp_pos", "^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/Shape", "op": "Shape"}, {"attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/Sqrt", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_5/multi_head_attention_17/Reshape_3/shape/2", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_5/sequential_13/dense_98/Tensordot/Const_2", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_5/sequential_13/dense_99/Tensordot/Const_2", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/range/start", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/strided_slice_1/stack", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/strided_slice_1/stack_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/strided_slice_1/stack_2", "op": "Const"}, {"attr": {"T": {"type": "DT_FLOAT"}}, "input": ["inp_embeddings", "^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "Func/StatefulPartitionedCall/input/_1", "op": "Identity"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_5/sequential_13/dense_99/Tensordot/axes", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/strided_slice_3/stack", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/strided_slice_3/stack_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/strided_slice_3/stack_2", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/output_model_gmm_dense_1/Const", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_5/multi_head_attention_17/Reshape/shape/1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/strided_slice_2/stack", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/strided_slice_2/stack_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/Reshape/shape/1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/Reshape/shape/2", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/Reshape/shape/3", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transpose/perm", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/dense_layers/sequential_7/out/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "12"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/dense_layers/sequential_7/out/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/dense_layers_1/sequential_14/hidden_0/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "66"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/dense_layers_1/sequential_14/hidden_0/MatMul/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "256"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/dense_layers_1/sequential_14/out/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "256"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/dense_layers_1/sequential_14/out/MatMul/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "170"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/output_model_gmm_dense_1/gmm_all/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "256"}, {"size": "170"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/output_model_gmm_dense_1/gmm_all/MatMul/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/layer_normalization_12/batchnorm/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/layer_normalization_12/batchnorm/mul/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/layer_normalization_13/batchnorm/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/layer_normalization_13/batchnorm/mul/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/layer_normalization_14/batchnorm/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/layer_normalization_14/batchnorm/mul/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/multi_head_attention_6/dense_40/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/multi_head_attention_6/dense_40/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/multi_head_attention_6/dense_41/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/multi_head_attention_6/dense_41/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/multi_head_attention_6/dense_42/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/multi_head_attention_6/dense_42/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/multi_head_attention_6/dense_43/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/multi_head_attention_6/dense_43/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/multi_head_attention_7/dense_44/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/multi_head_attention_7/dense_44/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/multi_head_attention_7/dense_45/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/multi_head_attention_7/dense_45/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/multi_head_attention_7/dense_46/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/multi_head_attention_7/dense_46/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/multi_head_attention_7/dense_47/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/multi_head_attention_7/dense_47/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "256"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/sequential_8/dense_48/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/sequential_8/dense_48/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/sequential_8/dense_49/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "256"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer/sequential_8/dense_49/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_1/layer_normalization_15/batchnorm/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_1/layer_normalization_15/batchnorm/mul/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_1/layer_normalization_16/batchnorm/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_1/layer_normalization_16/batchnorm/mul/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_1/layer_normalization_17/batchnorm/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_1/layer_normalization_17/batchnorm/mul/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_1/multi_head_attention_8/dense_50/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_1/multi_head_attention_8/dense_50/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_1/multi_head_attention_8/dense_51/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_1/multi_head_attention_8/dense_51/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_1/multi_head_attention_8/dense_52/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_1/multi_head_attention_8/dense_52/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_1/multi_head_attention_8/dense_53/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_1/multi_head_attention_8/dense_53/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_1/multi_head_attention_9/dense_54/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_1/multi_head_attention_9/dense_54/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_1/multi_head_attention_9/dense_55/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_1/multi_head_attention_9/dense_55/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_1/multi_head_attention_9/dense_56/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_1/multi_head_attention_9/dense_56/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_1/multi_head_attention_9/dense_57/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_1/multi_head_attention_9/dense_57/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "256"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_1/sequential_9/dense_58/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_1/sequential_9/dense_58/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_1/sequential_9/dense_59/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "256"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_1/sequential_9/dense_59/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_2/layer_normalization_18/batchnorm/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_2/layer_normalization_18/batchnorm/mul/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_2/layer_normalization_19/batchnorm/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_2/layer_normalization_19/batchnorm/mul/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_2/layer_normalization_20/batchnorm/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_2/layer_normalization_20/batchnorm/mul/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_2/multi_head_attention_10/dense_60/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_2/multi_head_attention_10/dense_60/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_2/multi_head_attention_10/dense_61/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_2/multi_head_attention_10/dense_61/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_2/multi_head_attention_10/dense_62/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_2/multi_head_attention_10/dense_62/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_2/multi_head_attention_10/dense_63/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_2/multi_head_attention_10/dense_63/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_2/multi_head_attention_11/dense_64/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_2/multi_head_attention_11/dense_64/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_2/multi_head_attention_11/dense_65/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_2/multi_head_attention_11/dense_65/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_2/multi_head_attention_11/dense_66/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_2/multi_head_attention_11/dense_66/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_2/multi_head_attention_11/dense_67/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_2/multi_head_attention_11/dense_67/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "256"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_2/sequential_10/dense_68/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_2/sequential_10/dense_68/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_2/sequential_10/dense_69/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "256"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_2/sequential_10/dense_69/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_3/layer_normalization_21/batchnorm/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_3/layer_normalization_21/batchnorm/mul/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_3/layer_normalization_22/batchnorm/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_3/layer_normalization_22/batchnorm/mul/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_3/layer_normalization_23/batchnorm/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_3/layer_normalization_23/batchnorm/mul/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_3/multi_head_attention_12/dense_70/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_3/multi_head_attention_12/dense_70/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_3/multi_head_attention_12/dense_71/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_3/multi_head_attention_12/dense_71/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_3/multi_head_attention_12/dense_72/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_3/multi_head_attention_12/dense_72/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_3/multi_head_attention_12/dense_73/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_3/multi_head_attention_12/dense_73/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_3/multi_head_attention_13/dense_74/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_3/multi_head_attention_13/dense_74/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_3/multi_head_attention_13/dense_75/BiasAdd/ReadVariableOp", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional/transformer_decoder/decoder_layer_3/multi_head_attention_13/dense_75/Tensordot/Reshape_1", "op": "Const"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": 