{"format": "graph-model", "generatedBy": "2.1.0", "weightsManifest": [{"weights": [{"dtype": "int32", "name": "StatefulPartitionedCall/transformer_embedding/transpose_2/perm", "shape": [3]}, {"dtype": "int32", "name": "StatefulPartitionedCall/transformer_embedding/meshgrid/Reshape_2/shape", "shape": [2]}, {"dtype": "int32", "name": "StatefulPartitionedCall/transformer_embedding/meshgrid/Reshape_3", "shape": [64, 1]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/layer_normalization_11/batchnorm/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/layer_normalization_11/batchnorm/mul/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/sequential_5/dense_35/Tensordot/Reshape_1", "shape": [256, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/sequential_5/dense_34/Tensordot/Reshape_1", "shape": [64, 256]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/layer_normalization_10/batchnorm/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/layer_normalization_10/batchnorm/mul/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/multi_head_attention_5/dense_33/Tensordot/Reshape_1", "shape": [64, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/multi_head_attention_5/dense_30/Tensordot/Reshape_1", "shape": [64, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/multi_head_attention_5/dense_30/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/multi_head_attention_5/dense_31/Tensordot/Reshape_1", "shape": [64, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/multi_head_attention_5/dense_31/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/multi_head_attention_5/dense_32/Tensordot/Reshape_1", "shape": [64, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/multi_head_attention_5/dense_32/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/layer_normalization_9/batchnorm/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/layer_normalization_9/batchnorm/mul/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/sequential_4/dense_29/Tensordot/Reshape_1", "shape": [256, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/sequential_4/dense_28/Tensordot/Reshape_1", "shape": [64, 256]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/layer_normalization_8/batchnorm/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/layer_normalization_8/batchnorm/mul/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/multi_head_attention_4/dense_27/Tensordot/Reshape_1", "shape": [64, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/multi_head_attention_4/dense_24/Tensordot/Reshape_1", "shape": [64, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/multi_head_attention_4/dense_24/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/multi_head_attention_4/dense_25/Tensordot/Reshape_1", "shape": [64, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/multi_head_attention_4/dense_25/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/multi_head_attention_4/dense_26/Tensordot/Reshape_1", "shape": [64, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/multi_head_attention_4/dense_26/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/layer_normalization_7/batchnorm/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/layer_normalization_7/batchnorm/mul/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/sequential_3/dense_23/Tensordot/Reshape_1", "shape": [256, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/sequential_3/dense_22/Tensordot/Reshape_1", "shape": [64, 256]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/layer_normalization_6/batchnorm/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/layer_normalization_6/batchnorm/mul/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/multi_head_attention_3/dense_21/Tensordot/Reshape_1", "shape": [64, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/multi_head_attention_3/dense_18/Tensordot/Reshape_1", "shape": [64, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/multi_head_attention_3/dense_18/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/multi_head_attention_3/dense_19/Tensordot/Reshape_1", "shape": [64, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/multi_head_attention_3/dense_19/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/multi_head_attention_3/dense_20/Tensordot/Reshape_1", "shape": [64, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/multi_head_attention_3/dense_20/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/layer_normalization_5/batchnorm/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/layer_normalization_5/batchnorm/mul/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/sequential_2/dense_17/Tensordot/Reshape_1", "shape": [256, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/sequential_2/dense_16/Tensordot/Reshape_1", "shape": [64, 256]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/layer_normalization_4/batchnorm/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/layer_normalization_4/batchnorm/mul/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/multi_head_attention_2/dense_15/Tensordot/Reshape_1", "shape": [64, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/multi_head_attention_2/dense_12/Tensordot/Reshape_1", "shape": [64, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/multi_head_attention_2/dense_12/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/multi_head_attention_2/dense_13/Tensordot/Reshape_1", "shape": [64, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/multi_head_attention_2/dense_13/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/multi_head_attention_2/dense_14/Tensordot/Reshape_1", "shape": [64, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/multi_head_attention_2/dense_14/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/layer_normalization_3/batchnorm/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/layer_normalization_3/batchnorm/mul/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/sequential_1/dense_11/Tensordot/Reshape_1", "shape": [256, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/sequential_1/dense_10/Tensordot/Reshape_1", "shape": [64, 256]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/layer_normalization_2/batchnorm/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/layer_normalization_2/batchnorm/mul/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/multi_head_attention_1/dense_9/Tensordot/Reshape_1", "shape": [64, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/multi_head_attention_1/dense_6/Tensordot/Reshape_1", "shape": [64, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/multi_head_attention_1/dense_6/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/multi_head_attention_1/dense_7/Tensordot/Reshape_1", "shape": [64, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/multi_head_attention_1/dense_7/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/multi_head_attention_1/dense_8/Tensordot/Reshape_1", "shape": [64, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/multi_head_attention_1/dense_8/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer/layer_normalization_1/batchnorm/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer/layer_normalization_1/batchnorm/mul/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer/sequential/dense_5/Tensordot/Reshape_1", "shape": [256, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer/sequential/dense_4/Tensordot/Reshape_1", "shape": [64, 256]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer/layer_normalization/batchnorm/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer/layer_normalization/batchnorm/add/y", "shape": []}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer/layer_normalization/batchnorm/mul/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer/multi_head_attention/dense_3/Tensordot/Reshape_1", "shape": [64, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer/multi_head_attention/dense/Tensordot/Reshape_1", "shape": [64, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer/multi_head_attention/dense/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer/multi_head_attention/dense_1/Tensordot/Reshape_1", "shape": [64, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer/multi_head_attention/dense_1/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "int32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/multi_head_attention_5/strided_slice_1/stack", "shape": [1]}, {"dtype": "int32", "name": "StatefulPartitionedCall/transformer_embedding/strided_slice_1/stack", "shape": [4]}, {"dtype": "int32", "name": "StatefulPartitionedCall/transformer_embedding/strided_slice_1/stack_2", "shape": [4]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/sub/x", "shape": []}, {"dtype": "int32", "name": "StatefulPartitionedCall/transformer_embedding/strided_slice_2/stack", "shape": [3]}, {"dtype": "int32", "name": "StatefulPartitionedCall/transformer_embedding/strided_slice_2/stack_1", "shape": [3]}, {"dtype": "int32", "name": "StatefulPartitionedCall/transformer_embedding/strided_slice_2/stack_2", "shape": [3]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/zeros/Const", "shape": []}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/multi_head_attention_5/mul/y", "shape": []}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer/multi_head_attention/dense_2/Tensordot/Reshape_1", "shape": [64, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer/multi_head_attention/dense_2/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "int32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/multi_head_attention_5/Reshape/shape/2", "shape": []}, {"dtype": "int32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/multi_head_attention_5/Reshape/shape/3", "shape": []}, {"dtype": "int32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/multi_head_attention_5/transpose/perm", "shape": [4]}, {"dtype": "float32", "name": "Func/StatefulPartitionedCall/input/_5", "shape": [1, 201, 64]}, {"dtype": "int32", "name": "StatefulPartitionedCall/transformer_embedding/strided_slice_4/stack", "shape": [2]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/stroke/Tensordot/Reshape_1", "shape": [3, 64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/stroke/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/Sqrt", "shape": []}, {"dtype": "int32", "name": "StatefulPartitionedCall/transformer_embedding/strided_slice_4/stack_2", "shape": [2]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer/multi_head_attention/dense_3/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer/sequential/dense_4/BiasAdd/ReadVariableOp", "shape": [256]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer/sequential/dense_5/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/multi_head_attention_1/dense_9/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/sequential_1/dense_10/BiasAdd/ReadVariableOp", "shape": [256]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/sequential_1/dense_11/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/multi_head_attention_2/dense_15/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/sequential_2/dense_16/BiasAdd/ReadVariableOp", "shape": [256]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/sequential_2/dense_17/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/multi_head_attention_3/dense_21/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/sequential_3/dense_22/BiasAdd/ReadVariableOp", "shape": [256]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/sequential_3/dense_23/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/multi_head_attention_4/dense_27/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/sequential_4/dense_28/BiasAdd/ReadVariableOp", "shape": [256]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/sequential_4/dense_29/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "int32", "name": "StatefulPartitionedCall/transformer_embedding/meshgrid/Size_1", "shape": []}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/multi_head_attention_5/dense_33/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "int32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer/sequential/dense_4/Tensordot/Const_2", "shape": [1]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/sequential_5/dense_34/BiasAdd/ReadVariableOp", "shape": [256]}, {"dtype": "int32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/multi_head_attention_5/dense_30/Tensordot/free", "shape": [2]}, {"dtype": "int32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/multi_head_attention_5/dense_30/Tensordot/Const_2", "shape": [1]}, {"dtype": "float32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/sequential_5/dense_35/BiasAdd/ReadVariableOp", "shape": [64]}, {"dtype": "int32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/sequential_5/dense_35/Tensordot/axes", "shape": [1]}, {"dtype": "int32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/sequential_5/dense_35/Tensordot/Const", "shape": [1]}, {"dtype": "int32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/multi_head_attention_5/strided_slice_1/stack_2", "shape": [1]}, {"dtype": "int32", "name": "StatefulPartitionedCall/transformer_embedding/transpose/perm", "shape": [2]}, {"dtype": "int32", "name": "StatefulPartitionedCall/transformer_embedding/SequenceMask/Const_3", "shape": []}, {"dtype": "int32", "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/multi_head_attention_5/Reshape/shape/1", "shape": []}, {"dtype": "int32", "name": "StatefulPartitionedCall/transformer_embedding/Tile_2/multiples", "shape": [2]}, {"dtype": "int32", "name": "StatefulPartitionedCall/transformer_embedding/range_2/start", "shape": []}, {"dtype": "float32", "name": "StatefulPartitionedCall/output_model_deterministic/sequential_6/mu/MatMul/ReadVariableOp", "shape": [64, 8]}, {"dtype": "float32", "name": "StatefulPartitionedCall/output_model_deterministic/sequential_6/mu/BiasAdd/ReadVariableOp", "shape": [8]}], "paths": ["group1-shard1of1.bin"]}], "userDefinedMetadata": {"signature": {"inputs": {"input_stroke:0": {"dtype": "DT_FLOAT", "name": "input_stroke:0", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "input_seq_len:0": {"dtype": "DT_INT32", "name": "input_seq_len:0", "tensorShape": {"dim": [{"size": "-1"}]}}}, "outputs": {"Identity:0": {"dtype": "DT_FLOAT", "name": "Identity:0", "tensorShape": {"dim": [{"size": "-1"}, {"size": "8"}]}}}}}, "convertedBy": "TensorFlow.js Converter v1.7.3", "modelTopology": {"versions": {"producer": 175}, "node": [{"op": "Placeholder", "attr": {"dtype": {"type": "DT_INT32"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}, "name": "input_seq_len"}, {"op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}, "name": "input_stroke"}, {"op": "NoOp", "input": ["^input_seq_len", "^input_stroke"], "name": "Func/StatefulPartitionedCall/input_control_node/_0"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transpose_2/perm"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/meshgrid/Reshape_2/shape"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/meshgrid/Reshape_3"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/layer_normalization_11/batchnorm/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/layer_normalization_11/batchnorm/mul/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/sequential_5/dense_35/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/sequential_5/dense_34/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/layer_normalization_10/batchnorm/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/layer_normalization_10/batchnorm/mul/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/multi_head_attention_5/dense_33/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/multi_head_attention_5/dense_30/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/multi_head_attention_5/dense_30/BiasAdd/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/multi_head_attention_5/dense_31/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/multi_head_attention_5/dense_31/BiasAdd/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/multi_head_attention_5/dense_32/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_5/multi_head_attention_5/dense_32/BiasAdd/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/layer_normalization_9/batchnorm/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/layer_normalization_9/batchnorm/mul/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/sequential_4/dense_29/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/sequential_4/dense_28/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/layer_normalization_8/batchnorm/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/layer_normalization_8/batchnorm/mul/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/multi_head_attention_4/dense_27/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/multi_head_attention_4/dense_24/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/multi_head_attention_4/dense_24/BiasAdd/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/multi_head_attention_4/dense_25/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/multi_head_attention_4/dense_25/BiasAdd/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/multi_head_attention_4/dense_26/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_4/multi_head_attention_4/dense_26/BiasAdd/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/layer_normalization_7/batchnorm/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/layer_normalization_7/batchnorm/mul/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/sequential_3/dense_23/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/sequential_3/dense_22/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/layer_normalization_6/batchnorm/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/layer_normalization_6/batchnorm/mul/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/multi_head_attention_3/dense_21/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/multi_head_attention_3/dense_18/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/multi_head_attention_3/dense_18/BiasAdd/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/multi_head_attention_3/dense_19/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/multi_head_attention_3/dense_19/BiasAdd/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/multi_head_attention_3/dense_20/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_3/multi_head_attention_3/dense_20/BiasAdd/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/layer_normalization_5/batchnorm/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/layer_normalization_5/batchnorm/mul/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/sequential_2/dense_17/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/sequential_2/dense_16/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/layer_normalization_4/batchnorm/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/layer_normalization_4/batchnorm/mul/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/multi_head_attention_2/dense_15/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/multi_head_attention_2/dense_12/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/multi_head_attention_2/dense_12/BiasAdd/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/multi_head_attention_2/dense_13/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/multi_head_attention_2/dense_13/BiasAdd/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/multi_head_attention_2/dense_14/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_2/multi_head_attention_2/dense_14/BiasAdd/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/layer_normalization_3/batchnorm/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/layer_normalization_3/batchnorm/mul/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/sequential_1/dense_11/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/sequential_1/dense_10/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/layer_normalization_2/batchnorm/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/layer_normalization_2/batchnorm/mul/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/multi_head_attention_1/dense_9/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/multi_head_attention_1/dense_6/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/multi_head_attention_1/dense_6/BiasAdd/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/multi_head_attention_1/dense_7/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/multi_head_attention_1/dense_7/BiasAdd/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/multi_head_attention_1/dense_8/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer_1/multi_head_attention_1/dense_8/BiasAdd/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer/layer_normalization_1/batchnorm/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer/layer_normalization_1/batchnorm/mul/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer/sequential/dense_5/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer/sequential/dense_4/Tensordot/Reshape_1"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer/layer_normalization/batchnorm/ReadVariableOp"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer/layer_normalization/batchnorm/add/y"}, {"op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "StatefulPartitionedCall/transformer_embedding/transformer_encoder/encoder_layer/layer_normalization/batchnorm/mul/ReadVariableOp"}, {"op": "Const", "input": 