{"userDefinedMetadata": {"signature": {"inputs": {"inp_embeddings:0": {"tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "8"}]}, "dtype": "DT_FLOAT", "name": "inp_embeddings:0"}, "inp_pos:0": {"tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "2"}]}, "dtype": "DT_FLOAT", "name": "inp_pos:0"}}, "outputs": {"Identity_1:0": {"tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}, "dtype": "DT_FLOAT", "name": "Identity_1:0"}, "Identity:0": {"tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "10"}, {"size": "2"}]}, "dtype": "DT_FLOAT", "name": "Identity:0"}, "Identity_3:0": {"tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "10"}, {"size": "2"}]}, "dtype": "DT_FLOAT", "name": "Identity_3:0"}, "Identity_2:0": {"tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}, "dtype": "DT_FLOAT", "name": "Identity_2:0"}}}}, "generatedBy": "2.1.0", "modelTopology": {"node": [{"op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "8"}]}}}, "name": "inp_embeddings"}, {"op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "2"}]}}}, "name": "inp_pos"}, {"op": "NoOp", "input": ["^inp_embeddings", "^inp_pos"], "name": "Func/StatefulPartitionedCall/input_control_node/_0"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/meshgrid/Reshape_2/shape"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/meshgrid/Reshape_3"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transpose_2/perm"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/layer_normalization_30/batchnorm/add/y"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/add/y"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/strided_slice_1/stack"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/strided_slice_1/stack_2"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/multi_head_attention_29/mul/y"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/multi_head_attention_29/strided_slice_1/stack"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/multi_head_attention_29/Reshape/shape/2"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/multi_head_attention_29/Reshape/shape/3"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/multi_head_attention_29/transpose/perm"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/Sqrt"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/multi_head_attention_29/Reshape_3/shape/2"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/sequential_21/dense_158/Tensordot/Const_2"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/sequential_21/dense_159/Tensordot/Const_2"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/range/start"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/strided_slice_1/stack"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/strided_slice_1/stack_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/strided_slice_1/stack_2"}, {"op": "Identity", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["inp_embeddings", "^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "Func/StatefulPartitionedCall/input/_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/sequential_21/dense_159/Tensordot/axes"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/strided_slice_3/stack"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/strided_slice_3/stack_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/strided_slice_3/stack_2"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/output_model_gmm_dense_2/Const"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/multi_head_attention_29/Reshape/shape/1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/strided_slice_2/stack"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/strided_slice_2/stack_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/Reshape_4/shape/1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/Reshape_4/shape/2"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/Reshape_4/shape/3"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transpose_4/perm"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/dense_layers_2/sequential_15/out/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "10"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/dense_layers_2/sequential_15/out/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/dense_layers_3/sequential_22/hidden_0/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/dense_layers_3/sequential_22/hidden_0/MatMul/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "256"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/dense_layers_3/sequential_22/out/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}, {"size": "256"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/dense_layers_3/sequential_22/out/MatMul/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "50"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/output_model_gmm_dense_2/gmm_all/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "256"}, {"size": "50"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/output_model_gmm_dense_2/gmm_all/MatMul/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_10/layer_normalization_42/batchnorm/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_10/layer_normalization_42/batchnorm/mul/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_10/layer_normalization_43/batchnorm/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_10/layer_normalization_43/batchnorm/mul/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_10/layer_normalization_44/batchnorm/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_10/layer_normalization_44/batchnorm/mul/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_10/multi_head_attention_26/dense_140/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_10/multi_head_attention_26/dense_140/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_10/multi_head_attention_26/dense_141/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_10/multi_head_attention_26/dense_141/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_10/multi_head_attention_26/dense_142/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_10/multi_head_attention_26/dense_142/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_10/multi_head_attention_26/dense_143/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_10/multi_head_attention_26/dense_143/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_10/multi_head_attention_27/dense_144/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_10/multi_head_attention_27/dense_144/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_10/multi_head_attention_27/dense_145/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_10/multi_head_attention_27/dense_145/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_10/multi_head_attention_27/dense_146/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_10/multi_head_attention_27/dense_146/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_10/multi_head_attention_27/dense_147/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_10/multi_head_attention_27/dense_147/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "256"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_10/sequential_20/dense_148/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_10/sequential_20/dense_148/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_10/sequential_20/dense_149/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "256"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_10/sequential_20/dense_149/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/layer_normalization_45/batchnorm/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/layer_normalization_45/batchnorm/mul/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/layer_normalization_46/batchnorm/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/layer_normalization_46/batchnorm/mul/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/layer_normalization_47/batchnorm/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/layer_normalization_47/batchnorm/mul/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/multi_head_attention_28/dense_150/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/multi_head_attention_28/dense_150/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/multi_head_attention_28/dense_151/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/multi_head_attention_28/dense_151/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/multi_head_attention_28/dense_152/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/multi_head_attention_28/dense_152/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/multi_head_attention_28/dense_153/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/multi_head_attention_28/dense_153/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/multi_head_attention_29/dense_154/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/multi_head_attention_29/dense_154/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/multi_head_attention_29/dense_155/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/multi_head_attention_29/dense_155/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/multi_head_attention_29/dense_156/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/multi_head_attention_29/dense_156/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/multi_head_attention_29/dense_157/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/multi_head_attention_29/dense_157/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "256"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/sequential_21/dense_158/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/sequential_21/dense_158/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/sequential_21/dense_159/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "256"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_11/sequential_21/dense_159/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/layer_normalization_30/batchnorm/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/layer_normalization_30/batchnorm/mul/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/layer_normalization_31/batchnorm/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/layer_normalization_31/batchnorm/mul/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/layer_normalization_32/batchnorm/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/layer_normalization_32/batchnorm/mul/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/multi_head_attention_18/dense_100/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/multi_head_attention_18/dense_100/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/multi_head_attention_18/dense_101/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/multi_head_attention_18/dense_101/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/multi_head_attention_18/dense_102/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/multi_head_attention_18/dense_102/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/multi_head_attention_18/dense_103/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/multi_head_attention_18/dense_103/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/multi_head_attention_19/dense_104/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/multi_head_attention_19/dense_104/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/multi_head_attention_19/dense_105/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/multi_head_attention_19/dense_105/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/multi_head_attention_19/dense_106/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/multi_head_attention_19/dense_106/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/multi_head_attention_19/dense_107/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/multi_head_attention_19/dense_107/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "256"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/sequential_16/dense_108/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/sequential_16/dense_108/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/sequential_16/dense_109/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "256"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_6/sequential_16/dense_109/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_7/layer_normalization_33/batchnorm/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_7/layer_normalization_33/batchnorm/mul/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_7/layer_normalization_34/batchnorm/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_7/layer_normalization_34/batchnorm/mul/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_7/layer_normalization_35/batchnorm/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_7/layer_normalization_35/batchnorm/mul/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_7/multi_head_attention_20/dense_110/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_7/multi_head_attention_20/dense_110/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_7/multi_head_attention_20/dense_111/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_7/multi_head_attention_20/dense_111/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_7/multi_head_attention_20/dense_112/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_7/multi_head_attention_20/dense_112/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_7/multi_head_attention_20/dense_113/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_7/multi_head_attention_20/dense_113/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_7/multi_head_attention_21/dense_114/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_7/multi_head_attention_21/dense_114/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_7/multi_head_attention_21/dense_115/BiasAdd/ReadVariableOp"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "name": "StatefulPartitionedCall/transformer_seq2seq_conditional_1/transformer_decoder_1/decoder_layer_7/multi_head_attention_21/dense_115/Tensordot/Reshape_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "input": 